Revit 2024 API
ParameterTypeId.RebarShapeHookStyle Property
 "Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarShapeHookStyle { get; }
Visual Basic
Public Shared ReadOnly Property RebarShapeHookStyle As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarShapeHookStyle {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace